dicta={"苏":{"省份":"江苏","省会":"南京","面积":10.26,"人口":7164},
       "浙":{"省份":"浙江","省会":"杭州","面积":10.2,"人口":4552},
       "皖":{"省份":"安徽","省会":"合肥","面积":13.97,"人口":6410},
       "闽":{"省份":"福建","省会":"福州","面积":12.13,"人口":3350},
       "赣":{"省份":"江西","省会":"南昌","面积":16.7,"人口":4302},}
dictb={"苏":8029.3,"浙":5737,"皖":6323.6,"闽":3941,"赣":4622.1}
for k,v in dictb.items():
    if k in dicta:
        dicta[k]["人口(万)"]=v
for k,v in dicta.items():
    print("{}省简称{}，省会在{}市，面积{}万平方千米，常住人口{}万。"
          .format(v["省份"],k,v["省会"],v["面积"],v["人口"]))
while True:
    a=input("省份简称：")
    if a not in dicta:
        print("省份不存在")
        break
    pr=input("查询的项目名称：")
    if pr not in dicta[a]:
        print("所查信息不存在")
        break
    jg=dicta[a][pr]
    print("你所查询的{}省{}信息为：{}".format(dicta[a]["省份"],pr,jg))
    break

